app/Controllers/Home.php

SELECT `description`
FROM `details`
WHERE `label` = 'üyelik sözleşmesi'
---
    public function uyeliksozlesmesi()
    {
        $detailsModel = model("DetailsModel");
        $data = [
            "title" => "Üyelik Sözleşmesi",
            "text" => $detailsModel->where("label", "üyelik sözleşmesi")->findColumn("description")[0],