app/Models/DetailsModel.php

SELECT `description`
FROM `details`
WHERE `label` = 'iletişim'
SELECT `description`
FROM `details`
WHERE `label` = 'kvkk'
SELECT `description`
FROM `details`
WHERE `label` = 'copyright'
---
    public function headerFooter()
    {
$data = [
    "hakkımızda" => $this->where("label","hakkımızda")->findColumn("description")[0],
    "iletişim" => $this->where("label","iletişim")->findColumn("description")[0],
    "kvkk" => $this->where("label","kvkk")->findColumn("description")[0],
    "copyright" => $this->where("label","copyright")->findColumn("description")[0],